src/cf/Documents/РегламентированныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РегламентированныйОтчет</Name>
			<Comment>(Общ)</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчетности</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбраннаяФорма</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
					<Comment>(Общ) Сохраненные данные отчета</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Comment>(Общ) Дата подписи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеревоНастройкиСтраниц</Name>
					<Comment>(Общ) Дерево со списком настроек страниц</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникОтчета</Name>
					<Comment>(Общ) Имя встроенной или имя файла внешней обработки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОрганаПосредника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОтчета</Name>
					<Comment>(Общ) Наименование регламентированного отчета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПачки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Comment>(Общ) Периодичность представления отчета</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьЕдиницыИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/НумераторПачекПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НумераторПачекПФР</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерПачки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ВыгрузкаРегламентированныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВыгрузкаРегламентированныхОтчетов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АрхивДанныхРегламентированнойОтчетности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоНалоговомуОргану</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТекстаВыгрузки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Выгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВерсииФорматовВыгрузки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/РегламентированныйОтчет/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обработчик обновления БРО 0.0.0.1, 1.0.1.60
//
Процедура НазначитьНомераПачекОтчетовПФР() Экспорт
	
	// Назначение номеров пачек для отчетов, по которым производилась выгрузка.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыгрузкаРегламентированныхОтчетовОсновная.Основание.Ссылка КАК РеглОтчет,
	               |	ВыгрузкаРегламентированныхОтчетовВыгрузки.ИмяФайла КАК ИмяФайла
	               |ИЗ
	               |	Документ.ВыгрузкаРегламентированныхОтчетов.Основная КАК ВыгрузкаРегламентированныхОтчетовОсновная
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыгрузкаРегламентированныхОтчетов.Выгрузки КАК ВыгрузкаРегламентированныхОтчетовВыгрузки
	               |		ПО ВыгрузкаРегламентированныхОтчетовОсновная.Ссылка = ВыгрузкаРегламентированныхОтчетовВыгрузки.Ссылка
	               |			И ВыгрузкаРегламентированныхОтчетовОсновная.НомерСтрокиТекстаВыгрузки = ВыгрузкаРегламентированныхОтчетовВыгрузки.НомерСтроки
	               |ГДЕ
	               |	(ВыгрузкаРегламентированныхОтчетовОсновная.Основание.ИсточникОтчета = ""РегламентированныйОтчетРСВ1""
	               |			ИЛИ ВыгрузкаРегламентированныхОтчетовОсновная.Основание.ИсточникОтчета = ""РегламентированныйОтчетРСВ2""
	               |			ИЛИ ВыгрузкаРегламентированныхОтчетовОсновная.Основание.ИсточникОтчета = ""РегламентированныйОтчетРВ3"")
	               |	И ВыгрузкаРегламентированныхОтчетовОсновная.Основание.НомерПачки = 0
	               |ИТОГИ ПО
	               |	РеглОтчет";
	ВыборкаОтчетов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОтчетов.Следующий() Цикл
		НомерПачки = 0;
		
		ВыбокаВыгрузок = ВыборкаОтчетов.Выбрать();
		Пока ВыбокаВыгрузок.Следующий() Цикл
			ОпределитьНомерПачкиПоИмениФайла(НомерПачки, ВыбокаВыгрузок.ИмяФайла);
		КонецЦикла;
		
		Если НомерПачки <> 0 Тогда
			Попытка
				ОтчетОбъект = ВыборкаОтчетов.РеглОтчет.ПолучитьОбъект();
				ОтчетОбъект.НомерПачки = НомерПачки;
				ОтчетОбъект.Записать();
			Исключение
				
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ЗапросПоследнихНомеров = Новый Запрос;
	ЗапросПоследнихНомеров.Текст = "ВЫБРАТЬ
	                               |	ЕСТЬNULL(НумераторПачекПФР.Организация, СчетчикПоДокументам.Организация) КАК Организация,
	                               |	ЕСТЬNULL(НумераторПачекПФР.Год, СчетчикПоДокументам.Год) КАК Год,
	                               |	ВЫБОР
	                               |		КОГДА ЕСТЬNULL(НумераторПачекПФР.НомерПачки, 0) >= ЕСТЬNULL(СчетчикПоДокументам.НомерПачки, 0)
	                               |			ТОГДА ЕСТЬNULL(НумераторПачекПФР.НомерПачки, 0)
	                               |		ИНАЧЕ ЕСТЬNULL(СчетчикПоДокументам.НомерПачки, 0)
	                               |	КОНЕЦ КАК Последний
	                               |ИЗ
	                               |	РегистрСведений.НумераторПачекПФР КАК НумераторПачекПФР
	                               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			РегламентированныйОтчет.Организация КАК Организация,
	                               |			МАКСИМУМ(РегламентированныйОтчет.НомерПачки) КАК НомерПачки,
	                               |			ГОД(РегламентированныйОтчет.ДатаОкончания) КАК Год
	                               |		ИЗ
	                               |			Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	                               |		ГДЕ
	                               |			(РегламентированныйОтчет.ИсточникОтчета = ""РегламентированныйОтчетРСВ1""
	                               |					ИЛИ РегламентированныйОтчет.ИсточникОтчета = ""РегламентированныйОтчетРСВ2""
	                               |					ИЛИ РегламентированныйОтчет.ИсточникОтчета = ""РегламентированныйОтчетРВ3"")
	                               |		
	                               |		СГРУППИРОВАТЬ ПО
	                               |			РегламентированныйОтчет.Организация,
	                               |			ГОД(РегламентированныйОтчет.ДатаОкончания)) КАК СчетчикПоДокументам
	                               |		ПО НумераторПачекПФР.Организация = СчетчикПоДокументам.Организация
	                               |			И НумераторПачекПФР.Год = СчетчикПоДокументам.Год
	                               |
	                               |УПОРЯДОЧИТЬ ПО
	                               |	Организация,
	                               |	Год";
	ТаблицаУчетаНомеров = ЗапросПоследнихНомеров.Выполнить().Выгрузить();
	
	ЗапросПоРеглОтчетамБезНомераПачки = Новый Запрос;
	ЗапросПоРеглОтчетамБезНомераПачки.Текст = "ВЫБРАТЬ
	                                          |	РегламентированныйОтчет.Ссылка КАК РеглОтчет,
	                                          |	РегламентированныйОтчет.Организация КАК Организация,
	                                          |	ГОД(РегламентированныйОтчет.ДатаОкончания) КАК Год
	                                          |ИЗ
	                                          |	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	                                          |ГДЕ
	                                          |	(РегламентированныйОтчет.ИсточникОтчета = ""РегламентированныйОтчетРСВ1""
	                                          |			ИЛИ РегламентированныйОтчет.ИсточникОтчета = ""РегламентированныйОтчетРСВ2""
	                                          |			ИЛИ РегламентированныйОтчет.ИсточникОтчета = ""РегламентированныйОтчетРВ3"")
	                                          |	И РегламентированныйОтчет.НомерПачки = 0";
	
	ВыборкаОтчетов = ЗапросПоРеглОтчетамБезНомераПачки.Выполнить().Выбрать();
	
	Пока ВыборкаОтчетов.Следующий() Цикл
		
		ПараметрыОтбора = Новый Структура ("Организация, Год", ВыборкаОтчетов.Организация, ВыборкаОтчетов.Год);
		РезультатПоиска = ТаблицаУчетаНомеров.НайтиСтроки(ПараметрыОтбора);
		
		Если РезультатПоиска.Количество() > 0 Тогда
			СтрокаСНомером = РезультатПоиска[0];
		Иначе
			СтрокаСНомером = ТаблицаУчетаНомеров.Добавить();
			СтрокаСНомером.Организация = ВыборкаОтчетов.Организация;
			СтрокаСНомером.Год = ВыборкаОтчетов.Год;
			СтрокаСНомером.Последний = 0;
		КонецЕсли;
		
		НомерПачки = СтрокаСНомером.Последний;
		НомерПачки = НомерПачки + 1;
		
		Попытка
			ОтчетОбъект = ВыборкаОтчетов.РеглОтчет.ПолучитьОбъект();
			ОтчетОбъект.НомерПачки = НомерПачки;
			ОтчетОбъект.Записать();
			РегламентированнаяОтчетность.УстановитьНомерПачкиВыгруженныхФайловПФР(ВыборкаОтчетов.Организация, ВыборкаОтчетов.Год, НомерПачки);
			СтрокаСНомером.Последний = НомерПачки;
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОпределитьНомерПачкиПоИмениФайла(НомерПачки, ИмяФайла)
	
	Если ТипЗнч(ИмяФайла) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	НомерПачкиВыгрузки = 0;
	
	ПозицияПервогоТокенаDCK = Найти(ИмяФайла, "DCK-");
	Если ПозицияПервогоТокенаDCK <> 0 Тогда
		НомерПачкиОрганизации = Сред(ИмяФайла, ПозицияПервогоТокенаDCK + 4, 5);
		
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(НомерПачкиОрганизации) Тогда
			НомерПачкиВыгрузки = Число(НомерПачкиОрганизации);
			
			Если НомерПачкиВыгрузки = 0 Тогда
				СтрокаБезПервогоВхождения = Сред(ИмяФайла, ПозицияПервогоТокенаDCK + 4 + 5);
				ПозицияВторогоТокенаDCK = Найти(СтрокаБезПервогоВхождения, "DCK-");
				
				НомерПачкиПодразделения = Сред(СтрокаБезПервогоВхождения, ПозицияВторогоТокенаDCK + 4, 5);
				Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(НомерПачкиПодразделения) Тогда
					НомерПачкиВыгрузки = Число(НомерПачкиПодразделения);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	НомерПачки = Макс(НомерПачки, НомерПачкиВыгрузки);
	
КонецПроцедуры

#КонецЕсли
